src/Documents/РеализацияТовараИУслуг/РеализацияТовараИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТовараИУслуг</name>
  <basedOn>Document.ВыездСПарковки</basedOn>
  <registerRecords>AccumulationRegister.ВзаимоРасчётыСКлиентами</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Огранизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Территория</name>
    <type>
      <types>CatalogRef.Территории</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Цена</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.Площадки</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Цена</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/РеализацияТовараИУслуг/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	ПересчитатьСтроку(Элементы.Услуги.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	ПересчитатьСтроку(Элементы.Услуги.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтроку(Строка)
	Строка.Сумма = Строка.Количество * Строка.Цена;
	ПересчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтоги()
	Объект.Сумма = Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПересчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ТабДок = СформироватьПечатнуюФормуНаСервере();
	Если ТабДок <> Неопределено Тогда
		ТабДок.Показать("Акт выполненных работ №" + Объект.Номер);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СформироватьПечатнуюФормуНаСервере()

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ДокументОбъект.ПолучитьМакет("АктВыполненыхРабот");
	Если Макет = Неопределено Тогда
		Сообщить("Макет печатной формы не найден!");
		Возврат Неопределено;
	КонецЕсли;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Номер = ДокументОбъект.Номер;
	ОбластьШапка.Параметры.Дата = ДокументОбъект.Дата;
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьОсновные = Макет.ПолучитьОбласть("ОсновныеДанные");
	ОбластьОсновные.Параметры.Организация = ДокументОбъект.Организация;
	ОбластьОсновные.Параметры.Контрагент = ДокументОбъект.Контрагент;
	ТабДок.Вывести(ОбластьОсновные);
	
	ОбластьТабЧасть = Макет.ПолучитьОбласть("ТабЧасть");
	Для каждого СтрокаТЧ Из ДокументОбъект.Услуги Цикл
		ОбластьТабЧасть.Параметры.Услуга = СтрокаТЧ.Услуга;
		ОбластьТабЧасть.Параметры.Количество = СтрокаТЧ.Количество;
		ОбластьТабЧасть.Параметры.Сумма = СтрокаТЧ.Сумма;
		ТабДок.Вывести(ОбластьТабЧасть);
	КонецЦикла;
	
	ОбщаяСумма = 0;
	СуммаКоличество = 0;
	Для каждого СтрокаТЧ Из ДокументОбъект.Услуги Цикл
		ОбщаяСумма = ОбщаяСумма + СтрокаТЧ.Сумма;
		СуммаКоличество = СуммаКоличество + СтрокаТЧ.Количество;
	КонецЦикла;
	
	ОбластьСумма = Макет.ПолучитьОбласть("Сумма");
	ОбластьСумма.Параметры.ОбщаяСумма = ОбщаяСумма;
	ОбластьСумма.Параметры.СуммаКоличество = СуммаКоличество;
	ТабДок.Вывести(ОбластьСумма);
	
	ОбластьШапкаЗаказчик = Макет.ПолучитьОбласть("ШапкаЗаказчик");
	ТабДок.Вывести(ОбластьШапкаЗаказчик);
	
	ОбластьЛица = Макет.ПолучитьОбласть("Лица");
	ОбластьЛица.Параметры.Организация = ДокументОбъект.Организация;
	ОбластьЛица.Параметры.Ответственный = ДокументОбъект.Организация.Ответственный;
	ОбластьЛица.Параметры.Контрагент = ДокументОбъект.Контрагент;
	ТабДок.Вывести(ОбластьЛица);
	
	Возврат ТабДок;
КонецФункции
